<?php
	$badword=array(
		'党','vip','admin','王二麻','MJJ','投资','赞助','中国','china','中华人民共和国','爸爸','妈妈','爷爷','管理','监察','检查','警察',
		'版主','斑竹','吧主','霸主','Manager','<','>','文学','作家','文章','作品','昵称','名字','名称','人名','name','网站','自定义','头衔',
		'关键字','关键词','保留','主席','公司','总经理','投资商','股东','Marshal','fuck','操','kao','cao',
		'黑社会','草','艹','胡锦涛','江泽民','吴邦国','贾庆林','李长春','李克强','贺国强','周永康','徐才厚','郭伯雄','李源潮','习近平',
		'毛泽东','周恩来','朱德','朱镕基','温家宝','色','版主','法轮功','sex','法轮大法','妓','娼','阴蒂','奸','尻','贱','叉','龟头',
		'屄','赑','妣','肏','尻','屌','bitch','法轮功','falundafa','falun','操你妈','sex','李洪志','!','@','#','$','%','^','&','(',')',
		'{','}','[',']','|','客服','站长','500mi','五百米',' ','测试','演示','ceshi','爹'
		);
	$buf = get_included_files();
	if (count($buf) == 1) {
		header('Content-Type:text/html;charset=utf-8;');
		echo '<div>';
		highlight_file(__FILE__);
		echo '</div>';
	}
?>